Repository: mkappus1/DatenmanagementMTHS24
Catalog: Woche 2/Skripte/TMX-EN-IT/tmx_teil_3.tmx
Source language: en
Languages: it

source: Indoor terrariums for animals
it: Terrari per interni per animali

source: Indoor terrariums for insects
it: Terrari per interni per insetti

source: Plates not of precious metal
it: Piatti non in metallo prezioso

source: Rails for towels, not of precious metal
it: Portasciugamani, non in metallo prezioso

source: Rings for towels, not of precious metal
it: Anelli portasciugamano, non in metallo prezioso

source: Biodegradable plates
it: Piatti biodegradabili

source: Biodegradable bowls
it: Ciotole biodegradabili

source: Biodegradable cups
it: Tazze biodegradabili

source: Biodegradable trays
it: Vassoi biodegradabili

source: Compostable bowls
it: Ciotole compostabili

source: Compostable plates
it: Piatti compostabili

source: Compostable trays
it: Vassoi compostabili
